---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRunsRampError
source: html/1185519d-545d-4ec6-481f-b19a132f1318.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRunsRampError Property

Ramp has no Runs. Can't create Ramp.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRunsRampError { get; }
```